Creating, Reading and Writing

In [1]:
import pandas as pd

Creating data

DataFrame:
A DataFrame is a two-dimensional table used to store structured data with rows and columns.

In [2]:
pd.DataFrame({'Yes': [50, 21], 'No': [131, 2]})

   Yes   No
0   50  131
1   21    2

In [3]:
pd.DataFrame({'Bob': ['I liked it.', 'It was awful.'], 
              'Sue': ['Pretty good.', 'Bland.']},
             index=['Product A', 'Product B'])

                     Bob           Sue
Product A    I liked it.  Pretty good.
Product B  It was awful.        Bland.

Series:
A Series is a one-dimensional sequence of values that represents a single column of data.

In [4]:
pd.Series([30, 35, 40], index=['2015 Sales', '2016 Sales', '2017 Sales'], name='Product A')

2015 Sales    30
2016 Sales    35
2017 Sales    40
Name: Product A, dtype: int64

Reading data

In [7]:
train_path = "../dataset/train_FD001.txt"

Real-world datasets are commonly stored as CSV files and can be loaded using `pd.read_csv()`.

In [13]:
import pandas as pd
train_path = "../dataset/train_FD001.txt"
train = pd.read_csv(train_path, sep=r"\s+", header=None)
print("Train shape:", train.shape)

Train shape: (20631, 26)

Functions like `shape` and `head()` help understand the size and preview the contents of a dataset.

In [14]:
train.head()

,0,1,2,3,4,5,6,7,8,9,...,16,17,18,19,20,21,22,23,24,25
0,1,1,-0.0007,-0.0004,100.0,518.67,641.82,1589.70,1400.60,14.62,...,521.66,2388.02,8138.62,8.4195,0.03,392,2388,100.0,39.06,23.4190
1,1,2,0.0019,-0.0003,100.0,518.67,642.15,1591.82,1403.14,14.62,...,522.28,2388.07,8131.49,8.4318,0.03,392,2388,100.0,39.00,23.4236
2,1,3,-0.0043,0.0003,100.0,518.67,642.35,1587.99,1404.20,14.62,...,522.42,2388.03,8133.23,8.4178,0.03,390,2388,100.0,38.95,23.3442
3,1,4,0.0007,0.0000,100.0,518.67,642.35,1582.79,1401.87,14.62,...,522.86,2388.08,8133.83,8.3682,0.03,392,2388,100.0,38.88,23.3739
4,1,5,-0.0019,-0.0002,100.0,518.67,642.37,1582.85,1406.22,14.62,...,522.19,2388.04,8133.80,8.4294,0.03,393,2388,100.0,38.90,23.4044

Excersise

In [15]:
import pandas as pd

fruits = pd.DataFrame({
    "Apples": [30],
    "Bananas": [21]
})

fruits

   Apples  Bananas
0      30       21

In [16]:
fruit_sales = pd.DataFrame(
    {"Apples": [35, 41], "Bananas": [21, 34]},
    index=["2017 Sales", "2018 Sales"]
)

fruit_sales

            Apples  Bananas
2017 Sales      35       21
2018 Sales      41       34

In [18]:
ingredients = pd.Series(
    ["4 cups", "1 cup", "2 large", "1 can"],
    index=["Flour", "Milk", "Eggs", "Spam"],
    name="Dinner"
)

ingredients

Flour     4 cups
Milk       1 cup
Eggs     2 large
Spam       1 can
Name: Dinner, dtype: str

In [20]:
reviews = pd.read_csv("../dataset/train_FD001.txt")
reviews

      1 1 -0.0007 -0.0004 100.0 518.67 641.82 1589.70 1400.60 14.62 21.61 554.36 2388.06 9046.19 1.30 47.47 521.66 2388.02 8138.62 8.4195 0.03 392 2388 100.00 39.06 23.4190
0      1 2 0.0019 -0.0003 100.0 518.67 642.15 1591.82...
1      1 3 -0.0043 0.0003 100.0 518.67 642.35 1587.99...
2      1 4 0.0007 0.0000 100.0 518.67 642.35 1582.79 ...
3      1 5 -0.0019 -0.0002 100.0 518.67 642.37 1582.8...
4      1 6 -0.0043 -0.0001 100.0 518.67 642.10 1584.4...
...                                                  ...
20625  100 196 -0.0004 -0.0003 100.0 518.67 643.49 15...
20626  100 197 -0.0016 -0.0005 100.0 518.67 643.54 16...
20627  100 198 0.0004 0.0000 100.0 518.67 643.42 1602...
20628  100 199 -0.0011 0.0003 100.0 518.67 643.23 160...
20629  100 200 -0.0032 -0.0005 100.0 518.67 643.85 16...

[20630 rows x 1 columns]

In [22]:
animals = pd.DataFrame({"Cows": [12, 20], "Goats": [22, 19]},
                       index=["Year 1", "Year 2"])

animals.to_csv("cows_and_goats.csv")